Repository: HannesGitH/vibration-test
Catalog: lib/l10n/intl_*.arb
Languages: de, es, ru

# appTitle
source: Custom Vibrator
es: Custom Vibrador

source: Settings
de: Einstellungen
es: Ajustes
ru: Настройки

source: Counter
de: Zähler
es: Contador
ru: Счетчик

source: Speed
de: Geschwindigkeit
es: Velocidad
ru: Скорость

# repeat
source: Loop
de: Wiederholen
es: Repetir
ru: Повтор

source: No vibrator found
de: Kein Vibrator gefunden
es: No se ha encontrado ningún vibrador
ru: Вибратор не найден

# noCustomVibrationSupport
source: This device does not support custom vibrations
de: Dein Gerät unterstützt keine benutzerdefinierten Vibrationen
es: Tu navegador no soporta la vibración personalizada
ru: Ваш браузер не поддерживает кастомные вибрации

source: default pattern
de: Standardmuster
es: Patrón por defecto
ru: Стандартный

source: still work in progress
de: noch in Arbeit
es: Todavía estamos trabajando en ello
ru: Все еще в разработке

# vibrationStoreTitle
source: Vibration Store
de: Vibrations-Shop
es: Tienda de vibraciones
ru: Магазин вибраций

source: Pattern
de: Muster
es: Patrón
ru: Модель

# presetTitle
source: Presets
de: Muster
es: Predefinido
ru: Предустановленные

# saveCurrentPatternTitle
source: Save Pattern
de: Muster speichern
es: Guardar patrón actual
ru: Сохранить текущую модель

# saveCurrentPatternNameField
source: name
es: Nombre del patrón
ru: Имя

source: OK
es: Aceptar
ru: ОК

# patternSavedSuccess
source: pattern Saved
de: Muster gespeichert
es: Patrón guardado correctamente
ru: Модель успешно сохранена

# patternSavedFailure
source: Pattern could not be saved
de: Muster konnte nicht gespeichert werden
es: No se ha podido guardar el patrón
ru: Не удалось сохранить модель

source: Buzz Mode
de: Buzz-Modus
es: Modo zumbido
ru: Режим вибрации

# buzzmodeInstruction
source: tap anywhere to go brrrrrr
de: Drücke und halte, um zu vibrieren
es: Mantén pulsado para vibrar
ru: Нажмите и удерживайте, чтобы начать вибрацию

# buzzmodeStopInstruction
source: release to stop
de: Loslassen, um zu stoppen
es: Suelta para parar
ru: Отпустите, чтобы остановить вибрацию

source: Keep Screen On
de: Bildschirm anlassen
es: Mantener pantalla encendida
ru: Не выключать экран

source: Support me
de: Unterstütze mich
es: Soporta mi trabajo

# keepVibrationScreenOff
source: Keep vibrating, even when screen is off
de: Vibration bei ausgeschaltetem Bildschirm
ru: Не выключать экран во время вибрации
